Revit 2026 API

# BalusterPatternGetBaluster Method

---

Gets information about the given baluster from the main baluster pattern.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BalusterInfo GetBaluster(
	int index
)
```
```vb
Public Function GetBaluster (
	index As Integer
) As BalusterInfo
```
```cpp
public:
BalusterInfo^ GetBaluster(
	int index
)
```
```fsharp
member GetBaluster :
        index : int -> BalusterInfo
```

#### Parameters

index Int32
     The baluster index.

#### Return Value

BalusterInfo The requested baluster or  if index is out of range.

#### Reference

BalusterPattern Class

Autodesk.Revit.DB.Architecture Namespace